{
  "navbar_links": {
    "Welcome": "index.html",
    "Projects": "projects.html",
    "Hobbies": "hobbies.html"
  },

  "student": {
      "first_name": "Ian",
      "middle_initial": "",
      "last_name": "Suo"
  },
  
  "banner": "Welcome to %name%'s E-Portfolio",
  
  "footer": "Contact info - Email: <a href='ysuo85@gmail.com'>ysuo85@gmail.com</a><a href='https://www.facebook.com/yi.suo' target='_blank'><img src='http://www.niftybuttons.com/modern/facebook.png' alt='Facebook' border='0' style='margin:1px; width: 20px; height: 20px;'></a><a href='https://www.linkedin.com/in/yi-suo-16a82a77' target='_blank'><img src='http://www.niftybuttons.com/modern/linkedin.png' alt='Linked In' border='0' style='margin:1px; width: 20px; height: 20px;'></a><a href='https://twitter.com/suo85' target='_blank'><img src='http://www.niftybuttons.com/modern/tumblr.png' alt='Twitter' border='0' style='margin:1px; width: 20px; height: 20px;'></a>",
    
  "components": [
        {
            "type": "header",
            "id": "1",
            "content": "Hobbies"
        },
        {
            "type": "paragraph",
            "id": "2",
            "content": "Once a Marine, always a Marine. I love moving around. Some people ask why I picked a sedatory career like computer science. Well, to be quite frank, I like going outside for fun. If it is for work, then I'd rather stay inside so when I get off work and go outside, it becomes even more fun! If you don't get it, it's okay. Anyway, these are some of my hobbies."
        },
        {
            "type": "list",
            "id": "3",
            "content": [
                "<h3>Hiking</h3> <p>This is my favorite hobby. The longest hike I've done was Havasu Falls near the Grand Canyon. It was a 3 hour hike of about 12 miles. We camped there at night and then hiked back up the mountain. Overall it was a good experience, I learned not to jump into the bottom of a fall because air bubbles caused by the splash of water creates a vaccuum and you'll sink straight down. Second longest hike I've done was to this mountainous region around Yuma, Arizona. Unlike Havasu Falls, this wasn't just a straight hike with a well defined path, so I made sure I had a GPS, a map, and a compass when I went. I'm glad I did because it was open desert and apparently there were mountain lions in that region. Luckily I didn't run into any.</p>",
                "<h3>Running</h3> <p>Now that I'm back in school, it is just more convenient for me to run around campus than hiking in the wilderness. The bike lanes through the woods are my favorite routes because nobody ever rides through them and if you run there at night, a lot of wild animals come out, especially deer.</p>",
                "<h3>Arduino</h3> <p>Right now I'm beginning to get into Arduino since if I get hired, my job next semester will require some basic knowledge of it. That I love hardware hacking. You will probably find me in the Innovation Lab on Tuesdays and Thursdays hacking the board.</p>",
                "<h3>Creative Writing</h3> <p>I took CWL 202, an arts requirement class this semester that teaches you how to write poems, screen plays, and short stories. It was a very rewarding experience. Being the offspring of two generations of writers, perhaps one day I can make this hobby into a career. Perhaps after I retire and just want to sit down and write about things? My favorite writings are short stories, they are simple and on point. Although I also like poetry, I haven't developed a style and I'm not quite good at using the inuendos yet, I find them very cryptic. I'm sure if I master poetry one day, women will all flock in my direction, that could be a good thing or a bad thing. I am starting to go to a lot of public readings hosted by writers. So far I've learned about the importance of revision and taking risks in writing. Below are some of the better writings I've done.</p>"
            ]
        },
        {
            "type": "list",
            "id": "4",
            "content": [
                "<a href='docs/deer_island.docx'>Deer Island</a> - A short story about looking at life with a different view.",
                "<a href='docs/roommate.docx'>My Roommate</a> - A short story about marriage."
            ]
        }
    ]
}