{
  "navbar_links": {
    "Welcome": "index.html",
    "Projects": "projects.html",
    "Hobbies": "hobbies.html"
  },

  "student": {
      "first_name": "Ian",
      "middle_initial": "",
      "last_name": "Suo"
  },
  
  "banner": "Welcome to %name%'s E-Portfolio",
  
  "footer": "Contact info - Email: <a href='ysuo85@gmail.com'>ysuo85@gmail.com</a><a href='https://www.facebook.com/yi.suo' target='_blank'><img src='http://www.niftybuttons.com/modern/facebook.png' alt='Facebook' border='0' style='margin:1px; width: 20px; height: 20px;'></a><a href='https://www.linkedin.com/in/yi-suo-16a82a77' target='_blank'><img src='http://www.niftybuttons.com/modern/linkedin.png' alt='Linked In' border='0' style='margin:1px; width: 20px; height: 20px;'></a><a href='https://twitter.com/suo85' target='_blank'><img src='http://www.niftybuttons.com/modern/tumblr.png' alt='Twitter' border='0' style='margin:1px; width: 20px; height: 20px;'></a>",
    
  "components": [
        {
            "type": "header",
            "id": "3",
            "content": "Biography"
        },
        {
            "type": "image",
            "id": "4",
            "src": "images/index/profile_pic.jpg",
            "alt": "Ian Suo",
            "width": "",
            "height": "",
            "float": "left"
        },
        {
            "type": "paragraph",
            "id": "5",
            "content": "My name is Ian Suo. I am a veteran and came back to Stony Brook University starting this semester. My major is Computer Science with a minor in Technical Systems Management. With this degree, I plan on coding and maintaining system infrastructures, be it financial systems, distributed systems, or embedded systems, if it runs a machine, I want to touch it. But I have to start somewhere, so I'm in the process of applying for the part-time position of Technical Student Lead at DoIT next semester. If I get the job, I get to maintain and reimage operating systems used by researchers on campus and assist them with various projects involved with Arduino. This will be an interesting job."
        },
        {
            "type": "paragraph",
            "id": "6",
            "content": "My class schedule next semester is going to be: CSE 220, AMS 310, CHE 132, and EST 325. In CSE 220 I will be learning about operating system fundamentals, AMS 310 is probability theory, CHE 132 is general chemistry, and EST 325 is technology at workplace."
        },
        {
            "type": "paragraph",
            "id": "7",
            "content": "While I was in the military, I was an F-18 mechanic. I did one deployment to Japan, soon after that, I joined the F-35B project and had the opportunity to work with some very motivated leaders to test and maintain the aircrafts in the first F-35B squadron in the Marine Corps. I've always liked software. When I realized a lot of the mechanical aircraft controls were phased out and replaced by softwares, I decided it's a good time to go back to school and pursue my passion to program these brains that is capable to command all sorts of machinery."
        }
    ]
}